[
    {
        "text": "Ishan or IK as I chose to call him is a bundle of energy and knowledge waiting for the right release. IMHO he's not a traditional master of one instead he's a master of all. Be it Android, web, DS, algos, iOS etc. - Ishan's got the wherewithal to find you a solution. He's got the right values and the right drive to be a great developer, thinker, and activist for the right technological causes in the future.",
        "writer": {
            "name": "Dhruv Raj Gupta",
            "position": "Co-Founder",
            "organization": "SeekSherpa"
        },
        "order": 1
    },
    {
        "text": "I was fortunate enough to be one of Ishan’s mentors during GSoC 2014. Ishan’s energy and his knowledge in the area of mobile application development were instrumental in creating our first Android App using the Mifos X Ecosystem.\nThe application was built around the ability to collect installments and payments for micro loans and savings with offline capability for rural areas with low connectivity.\nIshan delivered on spot and time, and always showed professional and gentle behavior. I’m happy that Ishan decided to stick with our community and is now voluntary leading the ongoing effort to broaden the App’s functionality.",
        "writer":{
            "name": "Markus Geiß",
            "position": "Chief Architect",
            "organization": "Mifos Initiative"
        },
        "order": 1
    },
    {
        "text": "Ishan is an extremely talented developer with highly strong fundamentals in java and other programming languages. He has developed numerous android applications, notable among them has been, Corona 13 which was the first ever application to represent a college fest.\nHe is a tireless contributor and was a great addition to the college-fest's management team.\nI would highly recommend Ishan for any position as he rises to the occasion and presents the best out of himself.",
        "writer": {
            "name": "Sankalp Agrawal",
            "position": "Freelance Designer",
            "organization": "Freelancer.com"
        },
        "order": 1
    }

]